<details>
<summary>For cloudbank cluster</summary>

<pre>
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.gke.google_container_node_pool.pools["core-pool"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
      ~ id                  = "projects/cb-1003-1696/locations/us-central1-b/clusters/cloudbank-2i2c-cluster/nodePools/core-pool" -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/cb-1003-1696/zones/us-central1-b/instanceGroupManagers/gke-cloudbank-2i2c-cluster-core-pool-7b9db384-grp",
        ] -> (known after apply)
      ~ max_pods_per_node   = 110 -> (known after apply)
        name                = "core-pool"
      + name_prefix         = (known after apply)
      ~ node_count          = 2 -> (known after apply)
      ~ node_locations      = [
          - "us-central1-b",
        ] -> (known after apply)
      + operation           = (known after apply)
        # (5 unchanged attributes hidden)



      ~ node_config {
          ~ machine_type      = "e2-highcpu-4" -> "n1-highmem-4" # forces replacement
            tags              = [
                "gke-cloudbank-2i2c-cluster",
                "gke-cloudbank-2i2c-cluster-core-pool",
            ]
          ~ taint             = [] -> (known after apply)
            # (10 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }


      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }
        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...

</pre>
</details>

<details>
<summary>For pilot hubs</summary>

<pre>
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.gke.google_container_node_pool.pools["core-pool"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
      ~ id                  = "projects/two-eye-two-see/locations/us-central1-b/clusters/low-touch-hubs-cluster/nodePools/core-pool" -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-low-touch-hubs-cluster-core-pool-1732ad61-grp",
        ] -> (known after apply)
      ~ max_pods_per_node   = 110 -> (known after apply)
        name                = "core-pool"
      + name_prefix         = (known after apply)
      ~ node_count          = 4 -> (known after apply)
      ~ node_locations      = [
          - "us-central1-b",
        ] -> (known after apply)
      + operation           = (known after apply)
        # (5 unchanged attributes hidden)



      ~ node_config {
          ~ machine_type      = "e2-highcpu-4" -> "n1-highmem-4" # forces replacement
            tags              = [
                "gke-low-touch-hubs-cluster",
                "gke-low-touch-hubs-cluster-core-pool",
            ]
          ~ taint             = [] -> (known after apply)
            # (10 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }


      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }
        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...
</pre>
</details>